app/controllers/sessions_controller.rb

  def create
    # @Login = .find_or_create_from_auth_hash(auth_hash)
    # self.current_user = @user
    Rails.logger.debug "OmniauthCallbacksController#shibboleth: request.env['omniauth.auth']: #{auth_hash.inspect}"
    case auth_hash[:provider]
    when 'shibboleth'
      @login = Login.find_or_create_by(
        provider: auth_hash[:provider],
        email: auth_hash[:info][:email],
        uid: Digest::SHA1.hexdigest(auth_hash[:uid].to_s)
      )
---
INSERT INTO "logins" ("access_token", "provider", "email", "uid", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT  "logins".* FROM "logins" WHERE "logins"."provider" = ? AND "logins"."email" = ? AND "logins"."uid" = ? LIMIT ?  [["provider", "shibboleth"], ["email", "jsvarne@emory.edu"], ["uid", 81394], ["LIMIT", 1]]