app/models/login.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-03-07 17:11:03.635505"], ["updated_at", "2019-03-07 17:11:03.635505"]]
---
  def ensure_user
    return true if self.user.present?
    self.user = User.create!